IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
		if (secStatus == BLE_GAP_SEC_STATUS_SUCCESS)
		{
			if (!pSecParams->bond)
			{
				// Pairing without bonding: no store buffer, but the LESC
				// public key exchange still needs its buffers.
				BtSecBmLink_t *pLink = LinkGet(ConnHdl);
				if (pLink == nullptr)
				{
					return BLE_ERROR_INVALID_CONN_HANDLE;
				}
				keyset.keys_own.p_pk  = LescPubKeyGet();
				keyset.keys_peer.p_pk = &pLink->PeerPk;
			}
			else
			{
				r = SecKeysetFill(ConnHdl, role, &keyset);
				if (r != NRF_SUCCESS)
				{
					pm_conn_state_user_flag_set(ConnHdl, s_FlagReplyPendBusy,
												r == NRF_ERROR_BUSY);
					return r;
				}
				bWriteBufHeld = true;
			}
		}
	}

	// Peripheral replies with its parameters; a central gave them at
	// sd_ble_gap_authenticate. The keyset is always passed, zeroed on reject.
	ble_gap_sec_params_t *pReplyParams = NULL;
#if defined(CONFIG_SOFTDEVICE_PERIPHERAL)
	if (role == BLE_GAP_ROLE_PERIPH && secStatus == BLE_GAP_SEC_STATUS_SUCCESS)
	{
		pReplyParams = pSecParams;
	}
#endif

	r = sd_ble_gap_sec_params_reply(ConnHdl, secStatus, pReplyParams, &keyset);
	pm_conn_state_user_flag_set(ConnHdl, s_FlagReplyPendBusy, r == NRF_ERROR_BUSY);

	if (bWriteBufHeld && r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
	{
		WriteBufRelease(ConnHdl);
	}

	if (r == NRF_ERROR_INVALID_STATE && !pm_conn_state_valid(ConnHdl))
	{
		return NRF_SUCCESS;		// link dropped; benign
	}
	// A live link returning INVALID_STATE is a sequencing defect (duplicate
	// reply, wrong phase) and surfaces to the caller.
	// NRF_ERROR_BUSY propagates: ReplyAttempt must see it to keep the exact
	// reply for the retry. Conversion to a success result for the public API
	// happens at the callers.
	return r;
}

// Perform a reply and keep the exact answer, including a rejection, for the
// BUSY retry. On a terminal result the pending record is cleared.
static uint32_t ReplyAttempt(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	uint32_t r = ParamsReplyPerform(ConnHdl, pSecParams);
	BtSecBmLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr)
	{
		if (r == NRF_ERROR_BUSY)
		{
			pLink->bReplyReject = (pSecParams == NULL);
			if (pSecParams != NULL)
			{
				pLink->ReplyParams = *pSecParams;
			}
			pLink->bReplyValid = true;
		}
		else
		{
			pLink->bReplyValid  = false;
			pLink->bReplyReject = false;
		}
	}
	return r;
}

// PM_EVT_CONN_SEC_PARAMS_REQ handling: emit the event with a reply context; if
// the application does not answer within its handler through
// sm_sec_params_reply, reply with the context (default) parameters.
static void ParamsRequestProcess(uint16_t ConnHdl, const ble_gap_sec_params_t *pPeerParams)
{
	SecParamsReplyCtx_t ctx;

	ctx.pSecParams   = s_pSecParams;
	ctx.bReplyCalled = false;

	struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_PARAMS_REQ, ConnHdl);
	evt.conn_sec_params_req.peer_params = pPeerParams;
	evt.conn_sec_params_req.context     = &ctx;
	EvtSend(&evt);

	if (!ctx.bReplyCalled)
	{
		uint32_t r = ReplyAttempt(ConnHdl, ctx.pSecParams);
		if (r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
		{
			UnexpectedErrorSend(ConnHdl, r);
		}
	}
}

// ---- link secure (pm_conn_secure and Security Request) ----------------------

#if defined(CONFIG_SOFTDEVICE_CENTRAL)
#if !defined(NDEBUG) && defined(DEBUG_ENABLE)
static bool ReconnectIrkPresent(const ble_gap_irk_t *pIrk)
{
	if (pIrk == nullptr)
	{
		return false;
	}

	uint8_t present = 0;
	for (uint32_t i = 0; i < BLE_GAP_SEC_KEY_LEN; i++)
	{
		present |= pIrk->irk[i];
	}
	return present != 0;
}

static void ReconnectPeerTrace(uint16_t ConnHdl, uint16_t PeerId)
{
	ble_gap_addr_t connAddr;
	memset(&connAddr, 0, sizeof(connAddr));
	uint32_t addrStatus = im_ble_addr_get(ConnHdl, &connAddr);

	if (addrStatus == NRF_SUCCESS)
	{
		DEBUG_PRINTF(
				"BM ID: hdl=%u peer=%u type=%u addr=%02x:%02x:%02x:%02x:%02x:%02x\r\n",
				(unsigned)ConnHdl, (unsigned)PeerId,
				(unsigned)connAddr.addr_type,
				connAddr.addr[5], connAddr.addr[4], connAddr.addr[3],
				connAddr.addr[2], connAddr.addr[1], connAddr.addr[0]);
	}
	else
	{
		DEBUG_PRINTF(
				"BM ID: hdl=%u peer=%u address read failed 0x%08lx\r\n",
				(unsigned)ConnHdl, (unsigned)PeerId,
				(unsigned long)addrStatus);
	}

	if (PeerId != PM_PEER_ID_INVALID)
	{
		return;
	}

	uint16_t candidateId;
	uint16_t iter;
	struct pm_peer_data_const peerData;
	uint8_t buffer[PM_PEER_DATA_MAX_SIZE];

	memset(&peerData, 0, sizeof(peerData));
	memset(buffer, 0, sizeof(buffer));
	peerData.all_data = buffer;
	pds_peer_data_iterate_prepare(&iter);

	while (pds_peer_data_iterate(PM_PEER_DATA_ID_BONDING, &candidateId,
								 &peerData, &iter))
	{
		const ble_gap_id_key_t *pId = &peerData.bonding_data->peer_ble_id;
		bool direct = addrStatus == NRF_SUCCESS &&
			connAddr.addr_type == pId->id_addr_info.addr_type &&
			memcmp(connAddr.addr, pId->id_addr_info.addr,
					BLE_GAP_ADDR_LEN) == 0;
		bool rpa = addrStatus == NRF_SUCCESS &&
			connAddr.addr_type == BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE &&
			ReconnectIrkPresent(&pId->id_info) &&
			im_address_resolve(&connAddr, &pId->id_info);

		DEBUG_PRINTF(
				"BM ID: candidate=%u type=%u addr=%02x:%02x:%02x:%02x:%02x:%02x "
				"irk=%u direct=%u rpa=%u\r\n",
				(unsigned)candidateId, (unsigned)pId->id_addr_info.addr_type,
				pId->id_addr_info.addr[5], pId->id_addr_info.addr[4],
				pId->id_addr_info.addr[3], pId->id_addr_info.addr[2],
				pId->id_addr_info.addr[1], pId->id_addr_info.addr[0],
				ReconnectIrkPresent(&pId->id_info) ? 1U : 0U,
				direct ? 1U : 0U, rpa ? 1U : 0U);
	}
}

static void ReconnectBondTrace(uint16_t PeerId, uint32_t Status,
							   const struct pm_peer_data_bonding *pBond)
{
	if (Status != NRF_SUCCESS || pBond == nullptr)
	{
		DEBUG_PRINTF("BM SEC: bond read peer=%u status=0x%08lx\r\n",
				(unsigned)PeerId, (unsigned long)Status);
		return;
	}

	const ble_gap_addr_t *pAddr = &pBond->peer_ble_id.id_addr_info;
	DEBUG_PRINTF(
			"BM SEC: bond peer=%u own(sc=%u len=%u) peer(sc=%u len=%u) "
			"idtype=%u id=%02x:%02x:%02x:%02x:%02x:%02x irk=%u\r\n",
			(unsigned)PeerId,
			(unsigned)pBond->own_ltk.enc_info.lesc,
			(unsigned)pBond->own_ltk.enc_info.ltk_len,
			(unsigned)pBond->peer_ltk.enc_info.lesc,
			(unsigned)pBond->peer_ltk.enc_info.ltk_len,
			(unsigned)pAddr->addr_type,
			pAddr->addr[5], pAddr->addr[4], pAddr->addr[3],
			pAddr->addr[2], pAddr->addr[1], pAddr->addr[0],
			ReconnectIrkPresent(&pBond->peer_ble_id.id_info) ? 1U : 0U);
}
#else
static inline void ReconnectPeerTrace(uint16_t ConnHdl, uint16_t PeerId)
{
	(void)ConnHdl;
	(void)PeerId;
}

static inline void ReconnectBondTrace(uint16_t PeerId, uint32_t Status,
								  const struct pm_peer_data_bonding *pBond)
{
	(void)PeerId;
	(void)Status;
	(void)pBond;
}
#endif

static uint32_t LinkSecureCentralEncrypt(uint16_t ConnHdl, uint16_t PeerId)
{
	struct pm_peer_data_bonding bondData;
	struct pm_peer_data peerData;
	const uint32_t bufSize = sizeof(bondData);
	const ble_gap_enc_key_t *pKey = NULL;

	memset(&bondData, 0, sizeof(bondData));
	peerData.bonding_data = &bondData;

	uint32_t r = pds_peer_data_read(PeerId, PM_PEER_DATA_ID_BONDING,
									&peerData, &bufSize);
	ReconnectBondTrace(PeerId, r, r == NRF_SUCCESS ? &bondData : nullptr);
	if (r == NRF_SUCCESS)
	{
		// Peer distributed its LTK as peripheral; for LESC both sides hold
		// the same LTK under own_ltk.
		pKey = &bondData.peer_ltk;
		if (bondData.own_ltk.enc_info.lesc)
		{
			pKey = &bondData.own_ltk;
		}
		else if (!im_master_id_is_valid(&pKey->master_id))
		{
			pKey = NULL;		// no usable legacy key
		}
	}
	else if (r == NRF_ERROR_BUSY)
	{
		return NRF_ERROR_BUSY;	// storage busy; retried by the pump
	}
	else if (r != NRF_ERROR_NOT_FOUND)
	{
		return NRF_ERROR_INTERNAL;
	}

	if (pKey == NULL || !pKey->enc_info.ltk_len)
	{
		DEBUG_PRINTF("BM SEC: peer=%u has no usable LTK, pair instead\r\n",
				(unsigned)PeerId);
		return NRF_ERROR_NOT_FOUND;		// no usable key; caller falls back to pairing
	}

	r = sd_ble_gap_encrypt(ConnHdl, &pKey->master_id, &pKey->enc_info);
	DEBUG_PRINTF(
			"BM SEC: encrypt hdl=%u peer=%u sc=%u len=%u ediv=0x%04x status=0x%08lx\r\n",
			(unsigned)ConnHdl, (unsigned)PeerId,
			(unsigned)pKey->enc_info.lesc, (unsigned)pKey->enc_info.ltk_len,
			(unsigned)pKey->master_id.ediv, (unsigned long)r);
	if (r == NRF_SUCCESS)
	{
		SecProcStart(ConnHdl, true, PM_CONN_SEC_PROCEDURE_ENCRYPTION);
	}
	return r;
}
#endif

static uint32_t LinkSecureAuthenticate(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	uint32_t r = sd_ble_gap_authenticate(ConnHdl, pSecParams);

