IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
// Commit the bond. NRF_ERROR_BUSY defers the store and the retry pumps repeat
// it; the terminal pairing event is emitted only when the store reaches a
// terminal result, so data_stored is truthful. NRF_ERROR_RESOURCES means the
// store was accepted but the storage needs maintenance: PM_EVT_STORAGE_FULL is
// emitted and the store reported as done, matching the stock module.
static void BondStoreAttempt(uint16_t ConnHdl, uint16_t PeerId, bool bNewPeer)
{
	BtSecBmLink_t *pLink = LinkGet(ConnHdl);
	uint16_t tempPeerId;

	uint32_t r = pdb_temp_peer_id_get(ConnHdl, &tempPeerId);
	if (r == NRF_SUCCESS)
	{
		r = pdb_write_buf_store(tempPeerId, PM_PEER_DATA_ID_BONDING, PeerId);
	}

	if (r == NRF_ERROR_BUSY && pLink != nullptr)
	{
		pLink->bStorePending = true;
		pLink->bStoreNewPeer = bNewPeer;
		pLink->StorePeerId   = PeerId;
		pLink->StoreConnHdl  = ConnHdl;
		return;			// retried by the pumps; no terminal event yet
	}

	if (pLink != nullptr)
	{
		pLink->bStorePending = false;
	}

	if (r == NRF_ERROR_RESOURCES)
	{
		StorageFullSend(ConnHdl);
		r = NRF_SUCCESS;
	}

	pm_conn_state_user_flag_set(ConnHdl, s_FlagSecProc, false);

	struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_SUCCEEDED, ConnHdl);
	evt.conn_sec_succeeded.procedure   = PM_CONN_SEC_PROCEDURE_BONDING;
	evt.conn_sec_succeeded.data_stored = (r == NRF_SUCCESS);
	if (r != NRF_SUCCESS)
	{
		UnexpectedErrorSend(ConnHdl, r);
		if (bNewPeer)
		{
			(void)im_peer_free(PeerId);
		}
	}
	EvtSend(&evt);
}

static void WriteBufRelease(uint16_t ConnHdl)
{
	uint16_t tempPeerId;

	if (pdb_temp_peer_id_get(ConnHdl, &tempPeerId) == NRF_SUCCESS)
	{
		(void)pdb_write_buf_release(tempPeerId, PM_PEER_DATA_ID_BONDING);
	}
}

static void AuthStatusSuccessProcess(const ble_gap_evt_t *pGapEvt)
{
	uint16_t connHdl = pGapEvt->conn_handle;
	BtSecBmLink_t *pKsLink = LinkGet(connHdl);

	if (pKsLink != nullptr && pKsLink->EncrKeySize != 0 &&
		pKsLink->EncrKeySize < s_MinKeySize)
	{
		// The key size check already failed the procedure and requested the
		// disconnect; do not store a bond keyed below policy.
		WriteBufRelease(connHdl);
		return;
	}

	if (!pGapEvt->params.auth_status.bonded)
	{
		// Pairing without bonding: nothing was allocated, nothing to store.
		PairingSuccessSend(pGapEvt, false);
		return;
	}

	// Locate or allocate the peer id for the new bond.
	bool bNewPeerId = false;
	struct pm_peer_data peerData;
	uint16_t tempPeerId;
	uint16_t peerId = im_peer_id_get_by_conn_handle(connHdl);

	uint32_t r = pdb_temp_peer_id_get(connHdl, &tempPeerId);
	if (r == NRF_SUCCESS)
	{
		r = pdb_write_buf_get(tempPeerId, PM_PEER_DATA_ID_BONDING, 1, &peerData);
	}
	if (r != NRF_SUCCESS)
	{
		UnexpectedErrorSend(connHdl, r);
		PairingSuccessSend(pGapEvt, false);
		return;
	}

	if (peerId == PM_PEER_ID_INVALID)
	{
		// Repairing detection: an existing bond for this identity.
		peerId = im_find_duplicate_bonding_data(peerData.bonding_data, PM_PEER_ID_INVALID);
		if (peerId != PM_PEER_ID_INVALID)
		{
			// Known identity re-pairing. Map the connection to the existing
			// peer first (the stock module does), so peer lookups work even
			// when the application denies. Then ask unless a decision was
			// already made for this procedure; default deny. On deny the old
			// bond record is kept, and the link is disconnected: it is
			// encrypted with a key the application refused, so leaving it up
			// and reporting success (the stock behavior) is wrong. The
			// procedure flag stays set; the disconnect path reports
			// CONN_SEC_FAILED.
			im_new_peer_id(connHdl, peerId);

			if (!AllowRepairing(connHdl))
			{
				struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_CONFIG_REQ, connHdl);
				evt.peer_id = peerId;
				EvtSend(&evt);

				if (!AllowRepairing(connHdl))
				{
					WriteBufRelease(connHdl);
					(void)sd_ble_gap_disconnect(connHdl,
												BLE_HCI_AUTHENTICATION_FAILURE);
					return;
				}
			}
		}
	}

	if (peerId == PM_PEER_ID_INVALID)
	{
		peerId = pds_peer_id_allocate();
		if (peerId == PM_PEER_ID_INVALID)
		{
			WriteBufRelease(connHdl);
			UnexpectedErrorSend(connHdl, NRF_ERROR_NO_MEM);
			PairingSuccessSend(pGapEvt, false);
			return;
		}
		bNewPeerId = true;
		im_new_peer_id(connHdl, peerId);
	}

	BondStoreAttempt(connHdl, peerId, bNewPeerId);
}

static void AuthStatusProcess(const ble_gap_evt_t *pGapEvt)
{
	LinkReplyClear(pGapEvt->conn_handle);

	if (pGapEvt->params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS)
	{
		AuthStatusSuccessProcess(pGapEvt);
	}
	else
	{
		WriteBufRelease(pGapEvt->conn_handle);
		SecFailureSend(pGapEvt->conn_handle,
					   pGapEvt->params.auth_status.auth_status,
					   pGapEvt->params.auth_status.error_src);
#if defined(CONFIG_PM_RA_PROTECTION)
		ast_auth_error_notify(pGapEvt->conn_handle);
#endif
	}
}

static void ConnSecUpdateProcess(const ble_gap_evt_t *pGapEvt)
{
	uint8_t keySize = pGapEvt->params.conn_sec_update.conn_sec.encr_key_size;
	BtSecBmLink_t *pLink = LinkGet(pGapEvt->conn_handle);

	if (pLink != nullptr)
	{
		pLink->EncrKeySize = keySize;
	}

	if (pm_conn_state_encrypted(pGapEvt->conn_handle) && keySize < s_MinKeySize)
	{
		// Under-keyed link: fail the procedure and disconnect regardless of
		// whether this is a fresh pairing or a reconnect.
		SecFailureSend(pGapEvt->conn_handle, BLE_GAP_SEC_STATUS_ENC_KEY_SIZE,
					   BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
		(void)sd_ble_gap_disconnect(pGapEvt->conn_handle,
									BLE_HCI_AUTHENTICATION_FAILURE);
		return;
	}

	if (ProcIsPairing(pGapEvt->conn_handle))
	{
		return;		// pairing completion is reported at AUTH_STATUS
	}

	if (!pm_conn_state_encrypted(pGapEvt->conn_handle))
	{
		SecFailureSend(pGapEvt->conn_handle, PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING,
					   BLE_GAP_SEC_STATUS_SOURCE_REMOTE);
		return;
	}

	pm_conn_state_user_flag_set(pGapEvt->conn_handle, s_FlagSecProc, false);

	struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_SUCCEEDED, pGapEvt->conn_handle);
	evt.conn_sec_succeeded.procedure   = PM_CONN_SEC_PROCEDURE_ENCRYPTION;
	evt.conn_sec_succeeded.data_stored = false;
	EvtSend(&evt);
}

static void DisconnectProcess(const ble_gap_evt_t *pGapEvt)
{
	uint16_t error =
		(pGapEvt->params.disconnected.reason == BLE_HCI_CONN_TERMINATED_DUE_TO_MIC_FAILURE) ?
		PM_CONN_SEC_ERROR_MIC_FAILURE : PM_CONN_SEC_ERROR_DISCONNECT;

