IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
	SecFailureSend(pGapEvt->conn_handle, error, BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
	LinkReplyClear(pGapEvt->conn_handle);

	BtSecBmLink_t *pLink = LinkGet(pGapEvt->conn_handle);
	if (pLink != nullptr && pLink->bStorePending)
	{
		pLink->bStorePending = false;
		if (pLink->bStoreNewPeer)
		{
			(void)im_peer_free(pLink->StorePeerId);
		}
	}
	WriteBufRelease(pGapEvt->conn_handle);
}

// ---- Retry pumps ------------------------------------------------------------

static void ReplyPendingHandle(uint16_t ConnHdl, void *pCtx)
{
	(void)pCtx;
	ble_gap_sec_params_t *pParams = s_pSecParams;
	BtSecBmLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr && pLink->bReplyValid)
	{
		// Replay the application reply exactly, including a rejection.
		pParams = pLink->bReplyReject ? NULL : &pLink->ReplyParams;
	}
	(void)ReplyAttempt(ConnHdl, pParams);
}

static void SecurePendingHandle(uint16_t ConnHdl, void *pCtx)
{
	(void)pCtx;
	bool bForce = pm_conn_state_user_flag_get(ConnHdl, s_FlagSecureForceRepair);
	bool bNull  = pm_conn_state_user_flag_get(ConnHdl, s_FlagSecureNullParams);

	(void)LinkSecure(ConnHdl, bNull, bForce, true);
}

static void PendingPumpsRun(void)
{
	(void)pm_conn_state_for_each_set_user_flag(s_FlagReplyPendBusy,
											   ReplyPendingHandle, NULL);
	(void)pm_conn_state_for_each_set_user_flag(s_FlagSecurePendBusy,
											   SecurePendingHandle, NULL);

	for (int i = 0; i < CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
	{
		if (s_Links[i].bStorePending && pm_conn_state_valid(s_Links[i].StoreConnHdl))
		{
			s_Links[i].bStorePending = false;
			BondStoreAttempt(s_Links[i].StoreConnHdl, s_Links[i].StorePeerId,
							 s_Links[i].bStoreNewPeer);
		}
	}
}

// ---- The bond store ---------------------------------------------------------

// Which linker declared region the peer data lives in. A project that wants
// it somewhere else moves the region in its linker script, not here.
#ifndef BT_SEC_BM_REGION_NO
#define BT_SEC_BM_REGION_NO			0
#endif

static NvmIntrf s_PdsIntrf;
static Nvm s_PdsMem;
static bool s_bPdsMounted = false;

// ---- sm_* API surface (called by peer_manager.c) ----------------------------

// The sm_* surface below is declared in modules/security_manager.h and
// BtSmpBondErase in bt_smp.h, whose C++ guards give those definitions their
// C linkage. BtPdsBmInit is declared in no header, so it alone is marked.

// Bring up the memory and mount the store on it. peer_data_storage.c calls
// this from pds_init; it is C, and Nvm is a C++ class, so the construction
// lives here and it gets a C entry point. Safe to call more than once.
extern "C" int BtPdsBmInit(void)
{
	if (s_bPdsMounted)
	{
		return 0;
	}

	// The region the linker set aside is the device: base and size come from
	// it, and the geometry from the part. Asked for before the interface is
	// brought up, so a project with no region declared does not leave one
	// initialised with no store on it.
	uintptr_t base = NvmRegionAddr(BT_SEC_BM_REGION_NO);
	size_t size = NvmRegionSize(BT_SEC_BM_REGION_NO);

	DEBUG_PRINTF("PDS: linker NVM%d at %08lX size %08lX\r\n",
			   BT_SEC_BM_REGION_NO, (unsigned long)base,
			   (unsigned long)size);

	if (base == 0 || size == 0)
	{
		DEBUG_PRINTF("PDS: no NVM%d region in the linker script, "
				   "peer data will not persist\r\n", BT_SEC_BM_REGION_NO);

		return -ENODEV;
	}

	// Nothing else is set up here beyond the memory itself. Who may touch it
	// and when is registered with the interface by whoever owns the radio, and
	// how long a program takes is the memory's own timing.
	if (s_PdsIntrf.Init() == false)
	{
		DEBUG_PRINTF("PDS: memory interface init failed\r\n");

		return -EIO;
	}

	NvmCfg_t cfg;
	memset(&cfg, 0, sizeof(cfg));
	NvmMcuCfg(cfg);

	cfg.BaseAddr = base;
	cfg.TotalSize = size;

	// The region is the whole of this device, so no window inside it.
	if (s_PdsMem.Init(cfg, &s_PdsIntrf, 0, 0) == false)
	{
		DEBUG_PRINTF("PDS: Nvm init failed\r\n");

		return -EIO;
	}

	DEBUG_PRINTF("PDS: Nvm ok, size %lu, sector %lu, wr %lu\r\n",
			   (unsigned long)s_PdsMem.Size(),
			   (unsigned long)s_PdsMem.LogicalSectorSize(),
			   (unsigned long)s_PdsMem.WriteGran());

	int r = BtPdsInit(&s_PdsMem);
	if (r != 0)
	{
		DEBUG_PRINTF("PDS: store mount failed %d\r\n", r);

		return r;
	}

	DEBUG_PRINTF("PDS: store mounted\r\n");

	s_bPdsMounted = true;

	return 0;
}

// Wipe the stored bonds. This is the platform half of the seam: the generic
// BtSmpBondClearAll in bt_smp_bond.cpp clears the RAM table it owns and then
// calls here for whatever the platform keeps. On this path the S145 stack owns
// the SMP state machine and peer_manager owns the bonds, so that is
// pm_peers_delete. bt_app_bm.cpp already named this as the entry that was
// missing. Overrides the weak answer in bt_smp_bond.cpp.
//
// The delete runs through peer_data_storage, which reports each peer with
// PM_EVT_PEER_DELETE_SUCCEEDED or _FAILED as it finishes.
void BtSmpBondErase(void)
{
	uint32_t err = pm_peers_delete();

	DEBUG_PRINTF("PDS: clear all peers, pm_peers_delete returned 0x%lX\r\n",
			   (unsigned long)err);
}

// pm_init calls smd_init right after sm_init. Everything the dispatcher
// initialized lives in this module and is set up in sm_init, so this only
// checks the ordering held.
uint32_t smd_init(void)
{
	return s_bInit ? NRF_SUCCESS : NRF_ERROR_INVALID_STATE;
}

uint32_t sm_init(void)
{
	if (s_bInit)
	{
		return NRF_ERROR_INVALID_STATE;
	}

	if (!BtLescInit())
	{
		return NRF_ERROR_INTERNAL;
	}

	s_FlagSecProc           = pm_conn_state_user_flag_acquire();
	s_FlagSecProcPairing    = pm_conn_state_user_flag_acquire();
	s_FlagSecProcBonding    = pm_conn_state_user_flag_acquire();
	s_FlagAllowRepairing    = pm_conn_state_user_flag_acquire();
	s_FlagSecurePendBusy    = pm_conn_state_user_flag_acquire();
	s_FlagSecureForceRepair = pm_conn_state_user_flag_acquire();
	s_FlagSecureNullParams  = pm_conn_state_user_flag_acquire();
	s_FlagReplyPendBusy     = pm_conn_state_user_flag_acquire();

	if (s_FlagReplyPendBusy == PM_CONN_STATE_USER_FLAG_INVALID)
	{
		DEBUG_PRINTF("SEC: could not acquire conn_state user flags; increase "
				"PM_CONN_STATE_USER_FLAG_COUNT\r\n");
		return NRF_ERROR_INTERNAL;
	}

#if defined(CONFIG_PM_RA_PROTECTION)
	uint32_t r = ast_init();
	if (r != NRF_SUCCESS)
	{
		return r;
	}
#endif

	s_bInit = true;
	return NRF_SUCCESS;
}

